Revit 2026 API

# TemperatureRatingTypeMaterialType Property

---

Get the material type information which this temperature rating type belongs to.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WireMaterialType MaterialType { get; }
```
```vb
Public ReadOnly Property MaterialType As WireMaterialType
	Get
```
```cpp
public:
property WireMaterialType^ MaterialType {
	WireMaterialType^ get ();
}
```
```fsharp
member MaterialType : WireMaterialType with get
```

#### Property Value

WireMaterialType

#### Reference

TemperatureRatingType Class

Autodesk.Revit.DB.Electrical Namespace